In [1]:
import pandas as pd

In [6]:
# QUESTION 1
data=[4,8,15,16,23,42]
pd.Series(data)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [7]:
#QUESTION 2
a=[45,43,56.78,'samad','sudh',True,'krish',6.34,23443,3456]
pd.Series(a)

0       45
1       43
2    56.78
3    samad
4     sudh
5     True
6    krish
7     6.34
8    23443
9     3456
dtype: object

In [13]:
data={'NAME':['ALICE','BOB','CHARLIE'],
      'AGE':[25,30,27],
      'GENDER':['FEMALE','MALE','FEMALE']
       
}

In [14]:
pd.DataFrame(data)

      NAME  AGE  GENDER
0    ALICE   25  FEMALE
1      BOB   30    MALE
2  CHARLIE   27  FEMALE

QUESTION 4

1.DataFrame is a 2D array while Series is a 1D array.
2.For a single-column DataFrame, an index can be optional, but a Series has to have an index defined
3.DataFrame is a tabular structure



1. pd.read_csv, pd.read_excel
2. df.head()
3. df.columns
4. df.drop()
5. df.len()
6. df.iloc()
7. df.dtypes
8. df.unique()

QUESTION 6

DataFrame and Panel are mutable.
Series is immutable.

In [18]:
month=pd.Series(['january','february','march','april','may'])
days=pd.Series([31,28,31,30,31])
bank_holidays=pd.Series([3,4,2,5,6])

In [34]:
data={'month':month,
      'days':days,
      'bank_holidays':bank_holidays
}

In [35]:
df=pd.concat(data,axis=1)
df

      month  days  bank_holidays
0   january    31              3
1  february    28              4
2     march    31              2
3     april    30              5
4       may    31              6